lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
#include <stddef.h>
#include <stdbool.h>
#include <stdint.h>

#include "nrf54l15_vpr_transport_shared.h"

#ifndef VPR_CS_DEDICATED_IMAGE
#define VPR_CS_DEDICATED_IMAGE 0
#endif

#define VPRCSR_NORDIC_VPRNORDICCTRL 0x7C0U
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL 0x7C1U
#define VPRCSR_NORDIC_TASKS 0x7E0U
#define VPRCSR_NORDIC_EVENTS 0x7E2U
#define VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk (1UL << 0U)
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos 16U
#define VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled 0x507DUL
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_HIBERNATE 0xFU
#define VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Msk (1UL << 17U)

#define BLE_CS_MAIN_MODE2 0x02U

#define BLE_CS_HCI_OP_READ_REMOTE_SUPPORTED_CAPABILITIES 0x208AU
#define BLE_CS_HCI_OP_SECURITY_ENABLE 0x208CU
#define BLE_CS_HCI_OP_SET_DEFAULT_SETTINGS 0x208DU
#define BLE_CS_HCI_OP_CREATE_CONFIG 0x2090U
#define BLE_CS_HCI_OP_REMOVE_CONFIG 0x2091U
#define BLE_CS_HCI_OP_SET_PROCEDURE_PARAMETERS 0x2093U
#define BLE_CS_HCI_OP_PROCEDURE_ENABLE 0x2094U
#if !VPR_CS_DEDICATED_IMAGE
#define VPR_HCI_OP_VENDOR_PING 0xFCF0U
#define VPR_HCI_OP_VENDOR_GET_TRANSPORT_INFO 0xFCF1U
#define VPR_HCI_OP_VENDOR_FNV1A32 0xFCF2U
#define VPR_HCI_OP_VENDOR_GET_CAPABILITIES 0xFCF3U
#define VPR_HCI_OP_VENDOR_CRC32 0xFCF4U
#define VPR_HCI_OP_VENDOR_CRC32C 0xFCF5U
#define VPR_HCI_OP_VENDOR_TICKER_CONFIGURE 0xFCF6U
#define VPR_HCI_OP_VENDOR_TICKER_READ_STATE 0xFCF7U
#define VPR_HCI_OP_VENDOR_ENTER_HIBERNATE 0xFCF8U
#define VPR_HCI_OP_VENDOR_TICKER_EVENT_CONFIGURE 0xFCF9U

#define VPR_VENDOR_SERVICE_VERSION_MAJOR 1U
#define VPR_VENDOR_SERVICE_VERSION_MINOR 7U
#define VPR_VENDOR_OP_PING (1UL << 0U)
#define VPR_VENDOR_OP_INFO (1UL << 1U)
#define VPR_VENDOR_OP_FNV1A32 (1UL << 2U)
#define VPR_VENDOR_OP_CAPABILITIES (1UL << 3U)
#define VPR_VENDOR_OP_CRC32 (1UL << 4U)
#define VPR_VENDOR_OP_CRC32C (1UL << 5U)
#define VPR_VENDOR_OP_TICKER_CONFIGURE (1UL << 6U)
#define VPR_VENDOR_OP_TICKER_READ_STATE (1UL << 7U)
#define VPR_VENDOR_OP_ENTER_HIBERNATE (1UL << 8U)
#define VPR_VENDOR_OP_TICKER_EVENT_CONFIGURE (1UL << 9U)
#define VPR_VENDOR_TRANSPORT_FLAG_RESTORED_FROM_HIBERNATE 0x80U
#define VPR_VENDOR_EVENT_TICKER 0xA0U
#endif
#define VPR_VENDOR_EVENT_CS_PEER_RESULT_TRIGGER 0xB1U
#define VPR_VENDOR_EVENT_CS_PEER_RESULT_SOURCE 0xB2U
#if !VPR_CS_DEDICATED_IMAGE
#define VPR_TICKER_EVENT_QUEUE_DEPTH 8U
#endif

#define BLE_CS_HCI_EVT_READ_REMOTE_SUPPORTED_CAPS_COMPLETE_V2 0x38U
#define BLE_CS_HCI_EVT_SECURITY_ENABLE_COMPLETE 0x2EU
#define BLE_CS_HCI_EVT_CONFIG_COMPLETE 0x2FU
#define BLE_CS_HCI_EVT_PROCEDURE_ENABLE_COMPLETE 0x30U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT 0x31U
#define BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE 0x32U

#define BLE_HCI_PACKET_TYPE_EVENT 0x04U
#define BLE_HCI_EVT_COMMAND_COMPLETE 0x0EU
#define BLE_HCI_EVT_COMMAND_STATUS 0x0FU
#define BLE_HCI_EVT_LE_META 0x3EU
#define BLE_HCI_EVT_VENDOR 0xFFU

extern uint8_t __stack_top[];

static volatile Nrf54l15VprTransportHostShared* const g_host_transport =
    (volatile Nrf54l15VprTransportHostShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_HOST_BASE;
static volatile Nrf54l15VprTransportVprShared* const g_vpr_transport =
    (volatile Nrf54l15VprTransportVprShared*)(uintptr_t)NRF54L15_VPR_TRANSPORT_VPR_BASE;

typedef struct {
  uint32_t count;
  uint32_t step;
  uint32_t heartbeat;
  uint32_t sequence;
  uint8_t flags;
} vpr_ticker_event_entry_t;

#if !VPR_CS_DEDICATED_IMAGE
static uint32_t g_ticker_enabled = 0U;
static uint32_t g_ticker_period_ticks = 0U;
static uint32_t g_ticker_step = 1U;
static uint32_t g_ticker_accum = 0U;
static uint32_t g_ticker_count = 0U;
static uint32_t g_ticker_event_enabled = 0U;
static uint32_t g_ticker_event_emit_every = 0U;
static uint32_t g_ticker_event_last_emitted_count = 0U;
static uint32_t g_ticker_event_sequence = 0U;
static uint32_t g_ticker_event_drop_count = 0U;
static vpr_ticker_event_entry_t g_ticker_event_queue[VPR_TICKER_EVENT_QUEUE_DEPTH];
static uint32_t g_ticker_event_queue_head = 0U;
static uint32_t g_ticker_event_queue_tail = 0U;
static uint32_t g_ticker_event_queue_count = 0U;
#endif
static uint8_t g_pending_cs_result_stage = 0U;
#if VPR_CS_DEDICATED_IMAGE
static uint32_t g_cs_next_procedure_heartbeat = 0U;
typedef struct __attribute__((packed)) {
  uint8_t configId;
  uint16_t procedureCounter;
  uint16_t sessionConnHandle;
  uint32_t demoChannelsPacked;
  uint8_t mainModeType;
  uint8_t subModeType;
  uint8_t minMainModeSteps;
  uint8_t maxMainModeSteps;
  uint8_t mainModeRepetition;
  uint8_t mode0Steps;
  uint8_t role;
  uint8_t rttType;
  uint8_t csSyncPhy;
  uint8_t channelMap[10];
  uint8_t channelMapRepetition;
  uint8_t channelSelectionType;
  uint8_t ch3cShape;
  uint8_t ch3cJump;
  uint8_t enhancements1;
  int8_t maxTxPowerDbm;
  uint16_t maxProcedureLen;
  uint16_t minProcedureInterval;
  uint16_t maxProcedureInterval;
  uint16_t maxProcedureCount;
  uint32_t minSubeventLen;
  uint32_t maxSubeventLen;
  uint8_t toneAntennaConfigSelection;
  uint8_t phy;
  int8_t txPowerDelta;
  uint8_t configCreated;
  uint8_t securityEnabled;
  uint8_t procedureParamsApplied;
  uint8_t procedureEnabled;
  uint8_t sessionOpen;
} vpr_cs_dedicated_state_t;

static vpr_cs_dedicated_state_t g_cs_state = {
    .configId = 1U,
    .procedureCounter = 0U,
    .sessionConnHandle = 0U,
    .demoChannelsPacked = 0x241A0E02U,
    .mainModeType = BLE_CS_MAIN_MODE2,
    .subModeType = 0xFFU,
    .minMainModeSteps = 3U,
    .maxMainModeSteps = 5U,
    .mainModeRepetition = 1U,
    .mode0Steps = 1U,
    .role = 0U,
    .rttType = 1U,
    .csSyncPhy = 2U,
    .channelMap = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0x1FU,
                   0x00U, 0x00U, 0x00U, 0x00U, 0x00U},
    .channelMapRepetition = 1U,
    .channelSelectionType = 1U,
    .ch3cShape = 1U,
    .ch3cJump = 3U,
    .enhancements1 = 0x01U,
    .maxTxPowerDbm = -8,
    .maxProcedureLen = 12U,
    .minProcedureInterval = 200U,
    .maxProcedureInterval = 300U,
    .maxProcedureCount = 8U,
    .minSubeventLen = 0x000456UL,
    .maxSubeventLen = 0x000678UL,
    .toneAntennaConfigSelection = 2U,
    .phy = 2U,
    .txPowerDelta = -6,
    .configCreated = 0U,
    .securityEnabled = 0U,
    .procedureParamsApplied = 0U,
    .procedureEnabled = 0U,
    .sessionOpen = 0U,
};

#define g_cs_config_id g_cs_state.configId
#define g_cs_procedure_counter g_cs_state.procedureCounter
#define g_cs_session_conn_handle g_cs_state.sessionConnHandle
#define g_cs_demo_channels_packed g_cs_state.demoChannelsPacked
#define g_cs_main_mode_type g_cs_state.mainModeType
#define g_cs_sub_mode_type g_cs_state.subModeType
#define g_cs_min_main_mode_steps g_cs_state.minMainModeSteps
#define g_cs_max_main_mode_steps g_cs_state.maxMainModeSteps
#define g_cs_main_mode_repetition g_cs_state.mainModeRepetition
#define g_cs_mode0_steps g_cs_state.mode0Steps
#define g_cs_role g_cs_state.role
#define g_cs_rtt_type g_cs_state.rttType
#define g_cs_cs_sync_phy g_cs_state.csSyncPhy
#define g_cs_channel_map g_cs_state.channelMap
#define g_cs_channel_map_repetition g_cs_state.channelMapRepetition
#define g_cs_channel_selection_type g_cs_state.channelSelectionType
#define g_cs_ch3c_shape g_cs_state.ch3cShape
#define g_cs_ch3c_jump g_cs_state.ch3cJump
#define g_cs_enhancements1 g_cs_state.enhancements1
#define g_cs_max_tx_power_dbm g_cs_state.maxTxPowerDbm
#define g_cs_max_procedure_len g_cs_state.maxProcedureLen
#define g_cs_min_procedure_interval g_cs_state.minProcedureInterval
#define g_cs_max_procedure_interval g_cs_state.maxProcedureInterval
#define g_cs_max_procedure_count g_cs_state.maxProcedureCount
#define g_cs_min_subevent_len g_cs_state.minSubeventLen
#define g_cs_max_subevent_len g_cs_state.maxSubeventLen
#define g_cs_tone_antenna_config_selection g_cs_state.toneAntennaConfigSelection
#define g_cs_phy g_cs_state.phy
#define g_cs_tx_power_delta g_cs_state.txPowerDelta
#define g_cs_config_created g_cs_state.configCreated
#define g_cs_security_enabled g_cs_state.securityEnabled
#define g_cs_procedure_params_applied g_cs_state.procedureParamsApplied
#define g_cs_procedure_enabled g_cs_state.procedureEnabled
#define g_cs_session_open g_cs_state.sessionOpen
#endif
#if !VPR_CS_DEDICATED_IMAGE
static uint32_t g_pending_hibernate = 0U;
static uint32_t g_restored_from_hibernate = 0U;
#endif

static bool host_request_pending(void);

#if VPR_CS_DEDICATED_IMAGE
enum {
  BLE_CS_HCI_STATUS_SUCCESS = 0x00U,
  BLE_CS_HCI_STATUS_COMMAND_DISALLOWED = 0x0CU,
  BLE_CS_HCI_STATUS_INVALID_PARAMS = 0x12U,
};

static void clear_active_cs_state(void);
#endif

static inline void fence_rw(void) {
  __asm__ volatile("fence rw, rw" ::: "memory");
}

static inline void enable_machine_interrupts(void) {
  const uint32_t mie_mask = 0x8U;
  __asm__ volatile("csrs mstatus, %0" : : "r"(mie_mask) : "memory");
}

static inline void write_vpr_sleepctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICSLEEPCTRL), "r"(value));
}

static inline void write_vpr_nordic_ctrl(uint32_t value) {
  __asm__ volatile("csrw %0, %1" : : "i"(VPRCSR_NORDIC_VPRNORDICCTRL), "r"(value));
}

static void bytes_zero(void *dst, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  if (out == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = 0U;
  }
}

static void bytes_copy(void *dst, const void *src, size_t len) {
  uint8_t *out = (uint8_t *)dst;
  const uint8_t *in = (const uint8_t *)src;
  if (out == NULL || in == NULL) {
    return;
  }
  for (size_t i = 0U; i < len; ++i) {
    out[i] = in[i];
  }
}

#if VPR_CS_DEDICATED_IMAGE
static void reset_dedicated_cs_state(void) {
  g_cs_config_id = 1U;
  g_cs_procedure_counter = 0U;
  g_cs_session_conn_handle = 0U;
  g_cs_demo_channels_packed = 0x241A0E02U;
  g_cs_main_mode_type = BLE_CS_MAIN_MODE2;
  g_cs_sub_mode_type = 0xFFU;
  g_cs_min_main_mode_steps = 3U;
  g_cs_max_main_mode_steps = 5U;
  g_cs_main_mode_repetition = 1U;
  g_cs_mode0_steps = 1U;
  g_cs_role = 0U;
  g_cs_rtt_type = 1U;
  g_cs_cs_sync_phy = 2U;
  g_cs_channel_map[0] = 0xFFU;
  g_cs_channel_map[1] = 0xFFU;
  g_cs_channel_map[2] = 0xFFU;
  g_cs_channel_map[3] = 0xFFU;
  g_cs_channel_map[4] = 0x1FU;
  g_cs_channel_map[5] = 0x00U;
  g_cs_channel_map[6] = 0x00U;
  g_cs_channel_map[7] = 0x00U;
  g_cs_channel_map[8] = 0x00U;
  g_cs_channel_map[9] = 0x00U;
  g_cs_channel_map_repetition = 1U;
  g_cs_channel_selection_type = 1U;
  g_cs_ch3c_shape = 1U;
  g_cs_ch3c_jump = 3U;
  g_cs_enhancements1 = 0x01U;
  g_cs_max_tx_power_dbm = -8;
  g_cs_max_procedure_len = 12U;
  g_cs_min_procedure_interval = 200U;
  g_cs_max_procedure_interval = 300U;
  g_cs_max_procedure_count = 8U;
  g_cs_min_subevent_len = 0x000456UL;
  g_cs_max_subevent_len = 0x000678UL;
  g_cs_tone_antenna_config_selection = 2U;
  g_cs_phy = 2U;
  g_cs_tx_power_delta = -6;
  g_cs_config_created = 0U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_cs_session_open = 0U;
  g_cs_next_procedure_heartbeat = 0U;
}
#endif

static void zero_vpr_data(void) {
  for (uint32_t i = 0U; i < NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA; ++i) {
    g_vpr_transport->vprData[i] = 0U;
  }
}

