lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static const uint8_t k_local_demo_pct_sample[3] = {0x00U, 0x04U, 0x00U};
#if VPR_CS_DEDICATED_IMAGE
static const uint8_t k_peer_demo_pct_samples[39][3] = {
    {0xF0U, 0xB3U, 0xF4U}, {0xE2U, 0xC3U, 0xF0U}, {0xD1U, 0xE3U, 0xECU},
    {0xBCU, 0x13U, 0xE9U}, {0xA3U, 0x63U, 0xE5U}, {0x86U, 0xC3U, 0xE1U},
    {0x66U, 0x43U, 0xDEU}, {0x43U, 0xF3U, 0xDAU}, {0x1CU, 0xB3U, 0xD7U},
    {0xF2U, 0xB2U, 0xD4U}, {0xC4U, 0xD2U, 0xD1U}, {0x62U, 0xA2U, 0xCCU},
    {0x2DU, 0x52U, 0xCAU}, {0xF6U, 0x41U, 0xC8U}, {0xBDU, 0x61U, 0xC6U},
    {0x82U, 0xC1U, 0xC4U}, {0x46U, 0x51U, 0xC3U}, {0x08U, 0x31U, 0xC2U},
    {0xCAU, 0x40U, 0xC1U}, {0x8AU, 0x90U, 0xC0U}, {0x4AU, 0x30U, 0xC0U},
    {0x0AU, 0x00U, 0xC0U}, {0xC9U, 0x1FU, 0xC0U}, {0x89U, 0x7FU, 0xC0U},
    {0x4AU, 0x0FU, 0xC1U}, {0x0BU, 0xEFU, 0xC1U}, {0xCDU, 0xFEU, 0xC2U},
    {0x90U, 0x4EU, 0xC4U}, {0x55U, 0xDEU, 0xC5U}, {0x1BU, 0xAEU, 0xC7U},
    {0xE3U, 0xADU, 0xC9U}, {0xAEU, 0xEDU, 0xCBU}, {0x7AU, 0x5DU, 0xCEU},
    {0x4AU, 0xFDU, 0xD0U}, {0x1CU, 0xCDU, 0xD3U}, {0xF1U, 0xCCU, 0xD6U},
    {0xC9U, 0xFCU, 0xD9U}, {0xA4U, 0x4CU, 0xDDU}, {0x83U, 0xBCU, 0xE0U},
};
#endif

static void append_mode2_sample_step(uint8_t *dst, uint8_t channel, const uint8_t pct[3]) {
  if (dst == NULL || pct == NULL) {
    return;
  }
  dst[0] = BLE_CS_MAIN_MODE2;
  dst[1] = channel;
  dst[2] = 5U;
  dst[3] = 0U;
  dst[4] = pct[0];
  dst[5] = pct[1];
  dst[6] = pct[2];
  dst[7] = 0x00U;
}

static void append_mode2_demo_step(uint8_t *dst, uint8_t channel) {
  append_mode2_sample_step(dst, channel, k_local_demo_pct_sample);
}

#if VPR_CS_DEDICATED_IMAGE
static void append_mode2_peer_demo_step(uint8_t *dst, uint8_t channel) {
  const uint8_t *pct =
      (channel < 39U) ? k_peer_demo_pct_samples[channel] : k_local_demo_pct_sample;
  append_mode2_sample_step(dst, channel, pct);
}

static bool channel_map_bit_enabled(const uint8_t *channel_map, uint8_t bit) {
  if (channel_map == NULL || bit >= 80U) {
    return false;
  }
  return (channel_map[bit >> 3U] & (uint8_t)(1U << (bit & 0x07U))) != 0U;
}

static bool channel_map_has_enabled_channels(const uint8_t *channel_map) {
  if (channel_map == NULL) {
    return false;
  }
  for (uint8_t i = 0U; i < 10U; ++i) {
    if (channel_map[i] != 0U) {
      return true;
    }
  }
  return false;
}

static uint32_t pack_demo_channels(const uint8_t channels[4]) {
  uint32_t packed = 0U;
  if (channels == NULL) {
    return 0U;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    packed |= ((uint32_t)channels[i] << (8U * i));
  }
  return packed;
}

static uint32_t current_demo_channels_packed(void) {
  const uint32_t fallback_packed =
      (g_cs_demo_channels_packed != 0U) ? g_cs_demo_channels_packed : g_host_transport->reserved;
  uint8_t enabled[40];
  uint8_t selected[4];
  uint8_t count = 0U;
  uint8_t jump = 1U;
  uint16_t procedure_index = 0U;
  uint16_t procedure_group = 0U;
  uint8_t start = 0U;

  for (uint8_t bit = 0U; bit < 40U; ++bit) {
    if (channel_map_bit_enabled(g_cs_channel_map, bit)) {
      enabled[count++] = bit;
    }
  }

  if (count == 0U) {
    return fallback_packed;
  }

  procedure_index = (g_cs_procedure_counter > 0U) ? (uint16_t)(g_cs_procedure_counter - 1U) : 0U;
  procedure_group = procedure_index;
  if (g_cs_channel_map_repetition > 1U) {
    procedure_group = (uint16_t)(procedure_index / g_cs_channel_map_repetition);
  }

  if (g_cs_channel_selection_type == 1U && g_cs_ch3c_jump > 0U) {
    jump = g_cs_ch3c_jump;
  }
  start = (uint8_t)((procedure_group * jump) % count);

  for (uint8_t i = 0U; i < 4U; ++i) {
    selected[i] = enabled[(uint8_t)((start + i) % count)];
  }
  return pack_demo_channels(selected);
}

static void update_demo_channels_from_create_config(void) {
  uint8_t channel_map[10];
  uint8_t channels[4];
  uint8_t found = 0U;
  uint8_t last = 2U;
  uint32_t packed = 0U;
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  bytes_copy(channel_map, (const void *)&g_host_transport->hostData[17], sizeof(channel_map));
  for (uint8_t bit = 0U; bit < 80U && found < 4U; ++bit) {
    if (channel_map_bit_enabled(channel_map, bit)) {
      last = bit;
      channels[found++] = bit;
    }
  }
  if (found == 0U) {
    return;
  }
  for (uint8_t i = found; i < 4U; ++i) {
    channels[i] = last;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    packed |= ((uint32_t)channels[i] << (8U * i));
  }
  g_cs_demo_channels_packed = packed;
}

static void update_defaults_from_set_default_settings(void) {
  if (g_host_transport->hostLen < 9U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_max_tx_power_dbm = (int8_t)g_host_transport->hostData[8];
}

static void update_create_config_from_command(void) {
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_config_id = g_host_transport->hostData[6];
  g_cs_main_mode_type = g_host_transport->hostData[8];
  g_cs_sub_mode_type = g_host_transport->hostData[9];
  g_cs_min_main_mode_steps = g_host_transport->hostData[10];
  g_cs_max_main_mode_steps = g_host_transport->hostData[11];
  g_cs_main_mode_repetition = g_host_transport->hostData[12];
  g_cs_mode0_steps = g_host_transport->hostData[13];
  g_cs_role = g_host_transport->hostData[14];
  g_cs_rtt_type = g_host_transport->hostData[15];
  g_cs_cs_sync_phy = g_host_transport->hostData[16];
  bytes_copy(g_cs_channel_map, (const void *)&g_host_transport->hostData[17], sizeof(g_cs_channel_map));
  g_cs_channel_map_repetition = g_host_transport->hostData[27];
  g_cs_channel_selection_type = g_host_transport->hostData[28];
  g_cs_ch3c_shape = g_host_transport->hostData[29];
  g_cs_ch3c_jump = g_host_transport->hostData[30];
  g_cs_enhancements1 = g_host_transport->hostData[31];
  g_cs_config_created = 1U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  update_demo_channels_from_create_config();
}

static uint8_t validate_create_config_command(void) {
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }

  const uint8_t config_id = g_host_transport->hostData[6];
  const uint8_t min_steps = g_host_transport->hostData[10];
  const uint8_t max_steps = g_host_transport->hostData[11];
  const uint8_t repetition = g_host_transport->hostData[12];
  const uint8_t mode0_steps = g_host_transport->hostData[13];
  const uint8_t cs_sync_phy = g_host_transport->hostData[16];

  if (config_id == 0U || min_steps == 0U || max_steps < min_steps ||
      repetition == 0U || mode0_steps == 0U || cs_sync_phy == 0U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!channel_map_has_enabled_channels((const uint8_t *)&g_host_transport->hostData[17])) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static void update_procedure_params_from_command(void) {
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_config_id = g_host_transport->hostData[6];
  g_cs_max_procedure_len = read_le16(&g_host_transport->hostData[7]);
  g_cs_min_procedure_interval = read_le16(&g_host_transport->hostData[9]);
  g_cs_max_procedure_interval = read_le16(&g_host_transport->hostData[11]);
  g_cs_max_procedure_count = read_le16(&g_host_transport->hostData[13]);
  g_cs_min_subevent_len = read_le24(&g_host_transport->hostData[15]);
  g_cs_max_subevent_len = read_le24(&g_host_transport->hostData[18]);
  g_cs_tone_antenna_config_selection = g_host_transport->hostData[21];
  g_cs_phy = g_host_transport->hostData[22];
  g_cs_tx_power_delta = (int8_t)g_host_transport->hostData[23];
  g_cs_procedure_params_applied = 1U;
  g_cs_next_procedure_heartbeat = 0U;
}

static void clear_active_cs_state(void) {
  g_cs_config_created = 0U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  g_cs_next_procedure_heartbeat = 0U;
}

static uint8_t validate_remove_config_command(void) {
  if (g_host_transport->hostLen < 7U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_host_transport->hostData[6] != g_cs_config_id) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_security_enable_command(void) {
  if (g_host_transport->hostLen < 6U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_set_procedure_params_command(void) {
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    g_vpr_transport->lastError = 0xD1U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    g_vpr_transport->lastError = (g_cs_session_open != 0U) ? 0xD2U : 0xD3U;
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U || g_cs_security_enabled == 0U) {
    g_vpr_transport->lastError =
        (g_cs_config_created == 0U) ? 0xD4U : 0xD5U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_host_transport->hostData[6] != g_cs_config_id) {
    g_vpr_transport->lastError = 0xD6U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  {
    const uint16_t max_procedure_len = read_le16(&g_host_transport->hostData[7]);
    const uint16_t min_interval = read_le16(&g_host_transport->hostData[9]);
    const uint16_t max_interval = read_le16(&g_host_transport->hostData[11]);
    const uint16_t max_count = read_le16(&g_host_transport->hostData[13]);
    const uint32_t min_subevent_len = read_le24(&g_host_transport->hostData[15]);
    const uint32_t max_subevent_len = read_le24(&g_host_transport->hostData[18]);
    if (max_procedure_len == 0U || min_interval == 0U || max_interval < min_interval ||
        max_count == 0U || min_subevent_len == 0U ||
        max_subevent_len < min_subevent_len) {
      g_vpr_transport->lastError = 0xD7U;
      return BLE_CS_HCI_STATUS_INVALID_PARAMS;
    }
  }
  g_vpr_transport->lastError = 0U;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

